In [1]:
import pandas as pd

In [2]:
goal_data = pd.read_csv('goal_stats_euro_leagues_2012-13.csv')

In [3]:
goal_data.head()

        Month           Stat   EPL  La Liga  Serie A  Bundesliga
0  08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
1  09/01/2012  MatchesPlayed  38.0       39     50.0        44.0
2  10/01/2012  MatchesPlayed  31.0       31     39.0        27.0
3  11/01/2012  MatchesPlayed  50.0       41     42.0        46.0
4  12/01/2012  MatchesPlayed  59.0       39     39.0        26.0

In [8]:
goal_data.loc[:2]

        Month           Stat   EPL  La Liga  Serie A  Bundesliga
0  08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
1  09/01/2012  MatchesPlayed  38.0       39     50.0        44.0
2  10/01/2012  MatchesPlayed  31.0       31     39.0        27.0

In [9]:
goal_data.ix[:2]

        Month           Stat   EPL  La Liga  Serie A  Bundesliga
0  08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
1  09/01/2012  MatchesPlayed  38.0       39     50.0        44.0
2  10/01/2012  MatchesPlayed  31.0       31     39.0        27.0

In [10]:
goal_data.iloc[:2]

        Month           Stat   EPL  La Liga  Serie A  Bundesliga
0  08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
1  09/01/2012  MatchesPlayed  38.0       39     50.0        44.0

In [4]:
dA = goal_data.iloc[:2,:3]

In [5]:
dA

        Month           Stat   EPL
0  08/01/2012  MatchesPlayed  20.0
1  09/01/2012  MatchesPlayed  38.0

In [6]:
dB = goal_data[2:]

In [7]:
dB

         Month           Stat    EPL  La Liga  Serie A  Bundesliga
2   10/01/2012  MatchesPlayed   31.0       31     39.0        27.0
3   11/01/2012  MatchesPlayed   50.0       41     42.0        46.0
4   12/01/2012  MatchesPlayed   59.0       39     39.0        26.0
5   01/01/2013  MatchesPlayed   42.0       40     40.0        18.0
6   02/01/2013  MatchesPlayed   30.0       40     40.0        36.0
7   03/01/2013  MatchesPlayed   35.0       38     39.0        36.0
8   04/01/2013  MatchesPlayed   42.0       42     41.0        36.0
9   05/01/2013  MatchesPlayed   33.0       40     40.0        27.0
10  06/02/2013  MatchesPlayed    NaN       10      NaN         NaN
11  08/01/2012    GoalsScored   57.0       60     21.0        23.0
12  09/01/2012    GoalsScored  111.0      112    133.0       135.0
13  10/01/2012    GoalsScored   95.0       88     97.0        77.0
14  11/01/2012    GoalsScored  121.0      116    120.0       137.0
15  12/01/2012    GoalsScored  183.0      109    125.0        72.0
16  01/01/2013    GoalsScored  117.0      121    104.0        51.0
17  02/01/2013    GoalsScored   87.0      110    100.0       101.0
18  03/01/2013    GoalsScored   91.0      101     99.0       106.0
19  04/01/2013    GoalsScored  105.0      127    102.0       104.0
20  05/01/2013    GoalsScored   96.0      109    102.0        92.0
21  06/01/2013    GoalsScored    NaN       80      NaN         NaN

In [14]:
dA.append(dB)

    Bundesliga    EPL  La Liga       Month  Serie A           Stat
0          NaN   20.0      NaN  08/01/2012      NaN  MatchesPlayed
1          NaN   38.0      NaN  09/01/2012      NaN  MatchesPlayed
2          NaN   31.0      NaN  10/01/2012      NaN  MatchesPlayed
2         27.0   31.0     31.0  10/01/2012     39.0  MatchesPlayed
3         46.0   50.0     41.0  11/01/2012     42.0  MatchesPlayed
4         26.0   59.0     39.0  12/01/2012     39.0  MatchesPlayed
5         18.0   42.0     40.0  01/01/2013     40.0  MatchesPlayed
6         36.0   30.0     40.0  02/01/2013     40.0  MatchesPlayed
7         36.0   35.0     38.0  03/01/2013     39.0  MatchesPlayed
8         36.0   42.0     42.0  04/01/2013     41.0  MatchesPlayed
9         27.0   33.0     40.0  05/01/2013     40.0  MatchesPlayed
10         NaN    NaN     10.0  06/02/2013      NaN  MatchesPlayed
11        23.0   57.0     60.0  08/01/2012     21.0    GoalsScored
12       135.0  111.0    112.0  09/01/2012    133.0    GoalsScored
13        77.0   95.0     88.0  10/01/2012     97.0    GoalsScored
14       137.0  121.0    116.0  11/01/2012    120.0    GoalsScored
15        72.0  183.0    109.0  12/01/2012    125.0    GoalsScored
16        51.0  117.0    121.0  01/01/2013    104.0    GoalsScored
17       101.0   87.0    110.0  02/01/2013    100.0    GoalsScored
18       106.0   91.0    101.0  03/01/2013     99.0    GoalsScored
19       104.0  105.0    127.0  04/01/2013    102.0    GoalsScored
20        92.0   96.0    109.0  05/01/2013    102.0    GoalsScored
21         NaN    NaN     80.0  06/01/2013      NaN    GoalsScored

In [15]:
dA

        Month           Stat   EPL
0  08/01/2012  MatchesPlayed  20.0
1  09/01/2012  MatchesPlayed  38.0
2  10/01/2012  MatchesPlayed  31.0

### Appending single row to dataFrame

In [8]:
algos={'search':['DFS','BFS','Binary Search','Linear'],
        'sorting': ['Quicksort','Mergesort','Heapsort','Bubble Sort'],
       'machine learning':['RandomForest','K Nearest Neighbor','Logistic Regression','K-Means Clustering']}

In [9]:
algosDF = pd.DataFrame(algos)

In [10]:
algosDF

      machine learning         search      sorting
0         RandomForest            DFS    Quicksort
1   K Nearest Neighbor            BFS    Mergesort
2  Logistic Regression  Binary Search     Heapsort
3   K-Means Clustering         Linear  Bubble Sort

In [11]:
moreAlgos={'search': 'ShortestPath'  , 'sorting': 'Insertion Sort',
            'machine learning': 'Linear Regression','a':'d'}

In [12]:
#Add dict directly to dataframe
algosDF.append(moreAlgos,ignore_index=True)

      machine learning         search         sorting    a
0         RandomForest            DFS       Quicksort  NaN
1   K Nearest Neighbor            BFS       Mergesort  NaN
2  Logistic Regression  Binary Search        Heapsort  NaN
3   K-Means Clustering         Linear     Bubble Sort  NaN
4    Linear Regression   ShortestPath  Insertion Sort    d

#### Merge

In [13]:
fin_data = pd.read_csv('data/fin.csv')

In [15]:
fin_data

,Date,Open,High,Low,Close,Adj Close,Volume
0,2017-06-12,6153.560059,6183.810059,6110.669922,6175.459961,6175.459961,2586540000
1,2017-06-13,6206.120117,6226.410156,6180.040039,6220.370117,6220.370117,2062110000
2,2017-06-14,6237.459961,6237.529785,6153.549805,6194.890137,6194.890137,1940440000
3,2017-06-15,6127.049805,6170.149902,6107.850098,6165.500000,6165.500000,1858130000
4,2017-06-16,6154.279785,6161.560059,6125.500000,6151.759766,6151.759766,3120640000
5,2017-06-19,6196.850098,6243.310059,6194.000000,6239.009766,6239.009766,1976970000
6,2017-06-20,6229.620117,6234.009766,6186.939941,6188.029785,6188.029785,2570130000
7,2017-06-21,6202.750000,6236.660156,6200.859863,6233.950195,6233.950195,2401440000
8,2017-06-22,6239.149902,6257.680176,6221.959961,6236.689941,6236.689941,2170250000
9,2017-06-23,6234.350098,6269.370117,6218.779785,6265.250000,6265.250000,2704600000
10,2017-06-26,6292.729980,6303.450195,6233.430176,6247.149902,6247.149902,2150630000
11,2017-06-27,6227.899902,6234.319824,6146.620117,6146.620117,6146.620117,2181830000
12,2017-06-28,6173.100098,6238.290039,6144.799805,6234.410156,6234.410156,2069400000
13,2017-06-29,6215.490234,6216.600098,6087.810059,6144.350098,6144.350098,2402250000
14,2017-06-30,6166.839844,6170.629883,6129.040039,6140.419922,6140.419922,1998330000
15,2017-07-03,6173.290039,6177.359863,6106.120117,6110.060059,6110.060059,1099560000
16,2017-07-05,6122.060059,6163.620117,6100.419922,6150.859863,6150.859863,1872130000
17,2017-07-06,6109.600098,6127.979980,6081.959961,6089.459961,6089.459961,1990590000
18,2017-07-07,6111.209961,6164.939941,6111.209961,6153.080078,6153.080078,1700630000
19,2017-07-10,6156.029785,6191.270020,6141.830078,6176.390137,6176.390137,1675470000
20,2017-07-11,6171.252930,6200.578613,6149.872559,6193.304688,6193.304688,1576969206

In [16]:
slice1 = fin_data.iloc[:2,:3]

In [17]:
slice1

         Date         Open         High
0  2017-06-12  6153.560059  6183.810059
1  2017-06-13  6206.120117  6226.410156

In [20]:
slice2 = fin_data.iloc[:2][['Date','Low','Close']]

In [21]:
slice2

         Date          Low        Close
0  2017-06-12  6110.669922  6175.459961
1  2017-06-13  6180.040039  6220.370117

In [23]:
slice1.merge(slice2)

         Date         Open         High          Low        Close
0  2017-06-12  6153.560059  6183.810059  6110.669922  6175.459961
1  2017-06-13  6206.120117  6226.410156  6180.040039  6220.370117

In [24]:
slice11 =  fin_data.iloc[:3,:3]

In [25]:
slice11

         Date         Open         High
0  2017-06-12  6153.560059  6183.810059
1  2017-06-13  6206.120117  6226.410156
2  2017-06-14  6237.459961  6237.529785

In [26]:
slice11.merge(slice2,how='outer')

         Date         Open         High          Low        Close
0  2017-06-12  6153.560059  6183.810059  6110.669922  6175.459961
1  2017-06-13  6206.120117  6226.410156  6180.040039  6220.370117
2  2017-06-14  6237.459961  6237.529785          NaN          NaN

In [37]:
slice11.merge(slice2,how='right')

         Date         Open         High          Low        Close
0  2017-06-12  6153.560059  6183.810059  6110.669922  6175.459961
1  2017-06-13  6206.120117  6226.410156  6180.040039  6220.370117

In [38]:
slice11.merge(slice2,how='left')

         Date         Open         High          Low        Close
0  2017-06-12  6153.560059  6183.810059  6110.669922  6175.459961
1  2017-06-13  6206.120117  6226.410156  6180.040039  6220.370117
2  2017-06-14  6237.459961  6237.529785          NaN          NaN

### Join Function

In [16]:
d1 = fin_data.ix[:3,:3]

In [17]:
fin_data

,Date,Open,High,Low,Close,Adj Close,Volume
0,2017-06-12,6153.560059,6183.810059,6110.669922,6175.459961,6175.459961,2586540000
1,2017-06-13,6206.120117,6226.410156,6180.040039,6220.370117,6220.370117,2062110000
2,2017-06-14,6237.459961,6237.529785,6153.549805,6194.890137,6194.890137,1940440000
3,2017-06-15,6127.049805,6170.149902,6107.850098,6165.500000,6165.500000,1858130000
4,2017-06-16,6154.279785,6161.560059,6125.500000,6151.759766,6151.759766,3120640000
5,2017-06-19,6196.850098,6243.310059,6194.000000,6239.009766,6239.009766,1976970000
6,2017-06-20,6229.620117,6234.009766,6186.939941,6188.029785,6188.029785,2570130000
7,2017-06-21,6202.750000,6236.660156,6200.859863,6233.950195,6233.950195,2401440000
8,2017-06-22,6239.149902,6257.680176,6221.959961,6236.689941,6236.689941,2170250000
9,2017-06-23,6234.350098,6269.370117,6218.779785,6265.250000,6265.250000,2704600000
10,2017-06-26,6292.729980,6303.450195,6233.430176,6247.149902,6247.149902,2150630000
11,2017-06-27,6227.899902,6234.319824,6146.620117,6146.620117,6146.620117,2181830000
12,2017-06-28,6173.100098,6238.290039,6144.799805,6234.410156,6234.410156,2069400000
13,2017-06-29,6215.490234,6216.600098,6087.810059,6144.350098,6144.350098,2402250000
14,2017-06-30,6166.839844,6170.629883,6129.040039,6140.419922,6140.419922,1998330000
15,2017-07-03,6173.290039,6177.359863,6106.120117,6110.060059,6110.060059,1099560000
16,2017-07-05,6122.060059,6163.620117,6100.419922,6150.859863,6150.859863,1872130000
17,2017-07-06,6109.600098,6127.979980,6081.959961,6089.459961,6089.459961,1990590000
18,2017-07-07,6111.209961,6164.939941,6111.209961,6153.080078,6153.080078,1700630000
19,2017-07-10,6156.029785,6191.270020,6141.830078,6176.390137,6176.390137,1675470000
20,2017-07-11,6171.252930,6200.578613,6149.872559,6193.304688,6193.304688,1576969206

In [18]:
d1

         Date         Open         High
0  2017-06-12  6153.560059  6183.810059
1  2017-06-13  6206.120117  6226.410156
2  2017-06-14  6237.459961  6237.529785
3  2017-06-15  6127.049805  6170.149902

In [21]:
d2 = fin_data.iloc[-2:,-3:]
d2

          Close    Adj Close      Volume
19  6176.390137  6176.390137  1675470000
20  6193.304688  6193.304688  1576969206

In [53]:
d1.join(d2,how='outer')

,Date,Open,High,Close,Adj Close,Volume
0,2017-06-12,6153.560059,6183.810059,NaN,NaN,NaN
1,2017-06-13,6206.120117,6226.410156,NaN,NaN,NaN
2,2017-06-14,6237.459961,6237.529785,NaN,NaN,NaN
3,2017-06-15,6127.049805,6170.149902,NaN,NaN,NaN
19,NaN,NaN,NaN,6176.390137,6176.390137,1.675470e+09
20,NaN,NaN,NaN,6193.304688,6193.304688,1.576969e+09

In [51]:
d1

         Date         Open         High
0  2017-06-12  6153.560059  6183.810059
1  2017-06-13  6206.120117  6226.410156
2  2017-06-14  6237.459961  6237.529785
3  2017-06-15  6127.049805  6170.149902

In [52]:
d2

          Close    Adj Close      Volume
19  6176.390137  6176.390137  1675470000
20  6193.304688  6193.304688  1576969206

In [54]:
help(d1.join)

Help on method join in module pandas.core.frame:

join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) method of pandas.core.frame.DataFrame instance
    Join columns with other DataFrame either on index or on a key
    column. Efficiently Join multiple DataFrame objects by index at once by
    passing a list.

    Parameters
    ----------
    other : DataFrame, Series with name field set, or list of DataFrame
        Index should be similar to one of the columns in this one. If a
        Series is passed, its name attribute must be set, and that will be
        used as the column name in the resulting joined DataFrame
    on : column name, tuple/list of column names, or array-like
        Column(s) in the caller to join on the index in other,
        otherwise joins index-on-index. If multiples
        columns given, the passed DataFrame must have a MultiIndex. Can
        pass an array as the join key if not already contained in the
        calling DataFrame. Like an Excel VLOOKUP operation
    how : {'left', 'right', 'outer', 'inner'}, default: 'left'
        How to handle the operation of the two objects.

        * left: use calling frame's index (or column if on is specified)
        * right: use other frame's index
        * outer: form union of calling frame's index (or column if on is
            specified) with other frame's index
        * inner: form intersection of calling frame's index (or column if
            on is specified) with other frame's index
    lsuffix : string
        Suffix to use from left frame's overlapping columns
    rsuffix : string
        Suffix to use from right frame's overlapping columns
    sort : boolean, default False
        Order result DataFrame lexicographically by the join key. If False,
        preserves the index order of the calling (left) DataFrame

    Notes
    -----
    on, lsuffix, and rsuffix options are not supported when passing a list
    of DataFrame objects

    Examples
    --------
    >>> caller = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
    ...                        'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

    >>> caller
        A key
    0  A0  K0
    1  A1  K1
    2  A2  K2
    3  A3  K3
    4  A4  K4
    5  A5  K5

    >>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
    ...                       'B': ['B0', 'B1', 'B2']})

    >>> other
        B key
    0  B0  K0
    1  B1  K1
    2  B2  K2

    Join DataFrames using their indexes.

    >>> caller.join(other, lsuffix='_caller', rsuffix='_other')

    >>>     A key_caller    B key_other
        0  A0         K0   B0        K0
        1  A1         K1   B1        K1
        2  A2         K2   B2        K2
        3  A3         K3  NaN       NaN
        4  A4         K4  NaN       NaN
        5  A5         K5  NaN       NaN


    If we want to join using the key columns, we need to set key to be
    the index in both caller and other. The joined DataFrame will have
    key as its index.

    >>> caller.set_index('key').join(other.set_index('key'))

    >>>      A    B
        key
        K0   A0   B0
        K1   A1   B1
        K2   A2   B2
        K3   A3  NaN
        K4   A4  NaN
        K5   A5  NaN

    Another option to join using the key columns is to use the on
    parameter. DataFrame.join always uses other's index but we can use any
    column in the caller. This method preserves the original caller's
    index in the result.

    >>> caller.join(other.set_index('key'), on='key')

    >>>     A key    B
        0  A0  K0   B0
        1  A1  K1   B1
        2  A2  K2   B2
        3  A3  K3  NaN
        4  A4  K4  NaN
        5  A5  K5  NaN


    See also
    --------
    DataFrame.merge : For column(s)-on-columns(s) operations

    Returns
    -------
    joined : DataFrame

In [55]:
algos={'search':['DFS','BFS','Binary Search','Linear'],
        'sorting': ['Quicksort','Mergesort','Heapsort','Bubble Sort'],
       'machine learning':['RandomForest','K Nearest Neighbor','Logistic Regression','K-Means Clustering']}

In [59]:
df1 = pd.DataFrame(algos)

In [57]:
newalgos={'search':['DFS','BFS','Binary Search','Linear'],
       'marks':[33,44,55,66]}

In [60]:
df2 = pd.DataFrame(newalgos)

In [61]:
df1

      machine learning         search      sorting
0         RandomForest            DFS    Quicksort
1   K Nearest Neighbor            BFS    Mergesort
2  Logistic Regression  Binary Search     Heapsort
3   K-Means Clustering         Linear  Bubble Sort

In [62]:
df2

   marks         search
0     33            DFS
1     44            BFS
2     55  Binary Search
3     66         Linear

In [65]:
df1.set_index('search',inplace=True)

In [66]:
df2.set_index('search',inplace=True)

In [67]:
df1.join(df2)

                  machine learning      sorting  marks
search
DFS                   RandomForest    Quicksort     33
BFS             K Nearest Neighbor    Mergesort     44
Binary Search  Logistic Regression     Heapsort     55
Linear          K-Means Clustering  Bubble Sort     66

In [68]:
df1.join(df2,lsuffix='search',rsuffix='search')

                  machine learning      sorting  marks
search
DFS                   RandomForest    Quicksort     33
BFS             K Nearest Neighbor    Mergesort     44
Binary Search  Logistic Regression     Heapsort     55
Linear          K-Means Clustering  Bubble Sort     66

In [69]:
df1.reset_index(inplace=True)

In [70]:
df2.reset_index(inplace=True)

In [71]:
df1

          search     machine learning      sorting
0            DFS         RandomForest    Quicksort
1            BFS   K Nearest Neighbor    Mergesort
2  Binary Search  Logistic Regression     Heapsort
3         Linear   K-Means Clustering  Bubble Sort

In [72]:
df2

          search  marks
0            DFS     33
1            BFS     44
2  Binary Search     55
3         Linear     66

In [74]:
compDF = df1.join(df2,lsuffix='search',rsuffix='search')

In [75]:
compDF

    searchsearch     machine learning      sorting   searchsearch  marks
0            DFS         RandomForest    Quicksort            DFS     33
1            BFS   K Nearest Neighbor    Mergesort            BFS     44
2  Binary Search  Logistic Regression     Heapsort  Binary Search     55
3         Linear   K-Means Clustering  Bubble Sort         Linear     66

In [79]:
compDF.drop('searchsearch',1)

      machine learning      sorting  marks
0         RandomForest    Quicksort     33
1   K Nearest Neighbor    Mergesort     44
2  Logistic Regression     Heapsort     55
3   K-Means Clustering  Bubble Sort     66

In [81]:
compDF.drop(compDF.columns[[0]],axis=1)

      machine learning      sorting  marks
0         RandomForest    Quicksort     33
1   K Nearest Neighbor    Mergesort     44
2  Logistic Regression     Heapsort     55
3   K-Means Clustering  Bubble Sort     66

In [88]:
compDF.drop(compDF.columns[[0]],axis=1)

      machine learning      sorting  marks
0         RandomForest    Quicksort     33
1   K Nearest Neighbor    Mergesort     44
2  Logistic Regression     Heapsort     55
3   K-Means Clustering  Bubble Sort     66

### More on Join

In [27]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [28]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [29]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [30]:
#One to One Join
df3 = pd.merge(df1, df2,on='employee')

In [31]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [32]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [33]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [34]:
#Many-to-one joins
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [35]:
#Many-to-Many Joins

In [36]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [33]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [34]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [58]:
df9 = pd.merge(df1,df5)
df9

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [39]:
df9.set_index('employee',inplace=True)

In [50]:
db = df9[['employee','skills']]
#.groupby('employee').groups
gb = db.groupby('employee')

In [52]:
for emp,data in gb:
    print (emp)
    print (data)

Bob
  employee        skills
0      Bob          math
1      Bob  spreadsheets
Jake
  employee  skills
2     Jake  coding
3     Jake   linux
Lisa
  employee  skills
4     Lisa  coding
5     Lisa   linux
Sue
  employee        skills
6      Sue  spreadsheets
7      Sue  organization

In [56]:
df9.set_index(['employee'],inplace=True)

In [57]:
df9.at['Bob','skills']

array(['math', 'spreadsheets'], dtype=object)

In [59]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [60]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [61]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [54]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop("name",axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [62]:
df1a = df1.set_index('employee')

In [63]:
df2a = df2.set_index('employee')

In [64]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [65]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [66]:
pd.merge(df1a,df2a,left_index=True, right_index=True)

                group  hire_date
employee
Lisa      Engineering       2004
Bob        Accounting       2008
Jake      Engineering       2012
Sue                HR       2014

In [67]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [68]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 1, 4, 2]})

In [69]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [70]:
df9

   name  rank
0   Bob     1
1  Jake     1
2  Lisa     4
3   Sue     2

In [71]:
pd.merge(df8,df9,on="name")

   name  rank_x  rank_y
0   Bob       1       1
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [72]:
pd.merge(df8,df9, on="name", suffixes=["_L","_R"])

   name  rank_L  rank_R
0   Bob       1       1
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [77]:
pd.merge(df8,df9, on=["name","rank"], suffixes=["_L","_R"])

  name  rank
0  Bob     1

In [83]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [91]:
#df9.join(df8,on=["name","rank"], lsuffix="L", rsuffix="R",how="inner")

In [86]:
help(df8.join)

Help on method join in module pandas.core.frame:

join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) method of pandas.core.frame.DataFrame instance
    Join columns with other DataFrame either on index or on a key
    column. Efficiently Join multiple DataFrame objects by index at once by
    passing a list.

    Parameters
    ----------
    other : DataFrame, Series with name field set, or list of DataFrame
        Index should be similar to one of the columns in this one. If a
        Series is passed, its name attribute must be set, and that will be
        used as the column name in the resulting joined DataFrame
    on : column name, tuple/list of column names, or array-like
        Column(s) in the caller to join on the index in other,
        otherwise joins index-on-index. If multiples
        columns given, the passed DataFrame must have a MultiIndex. Can
        pass an array as the join key if not already contained in the
        calling DataFrame. Like an Excel VLOOKUP operation
    how : {'left', 'right', 'outer', 'inner'}, default: 'left'
        How to handle the operation of the two objects.

        * left: use calling frame's index (or column if on is specified)
        * right: use other frame's index
        * outer: form union of calling frame's index (or column if on is
            specified) with other frame's index
        * inner: form intersection of calling frame's index (or column if
            on is specified) with other frame's index
    lsuffix : string
        Suffix to use from left frame's overlapping columns
    rsuffix : string
        Suffix to use from right frame's overlapping columns
    sort : boolean, default False
        Order result DataFrame lexicographically by the join key. If False,
        preserves the index order of the calling (left) DataFrame

    Notes
    -----
    on, lsuffix, and rsuffix options are not supported when passing a list
    of DataFrame objects

    Examples
    --------
    >>> caller = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
    ...                        'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

    >>> caller
        A key
    0  A0  K0
    1  A1  K1
    2  A2  K2
    3  A3  K3
    4  A4  K4
    5  A5  K5

    >>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
    ...                       'B': ['B0', 'B1', 'B2']})

    >>> other
        B key
    0  B0  K0
    1  B1  K1
    2  B2  K2

    Join DataFrames using their indexes.

    >>> caller.join(other, lsuffix='_caller', rsuffix='_other')

    >>>     A key_caller    B key_other
        0  A0         K0   B0        K0
        1  A1         K1   B1        K1
        2  A2         K2   B2        K2
        3  A3         K3  NaN       NaN
        4  A4         K4  NaN       NaN
        5  A5         K5  NaN       NaN


    If we want to join using the key columns, we need to set key to be
    the index in both caller and other. The joined DataFrame will have
    key as its index.

    >>> caller.set_index('key').join(other.set_index('key'))

    >>>      A    B
        key
        K0   A0   B0
        K1   A1   B1
        K2   A2   B2
        K3   A3  NaN
        K4   A4  NaN
        K5   A5  NaN

    Another option to join using the key columns is to use the on
    parameter. DataFrame.join always uses other's index but we can use any
    column in the caller. This method preserves the original caller's
    index in the result.

    >>> caller.join(other.set_index('key'), on='key')

    >>>     A key    B
        0  A0  K0   B0
        1  A1  K1   B1
        2  A2  K2   B2
        3  A3  K3  NaN
        4  A4  K4  NaN
        5  A5  K5  NaN


    See also
    --------
    DataFrame.merge : For column(s)-on-columns(s) operations

    Returns
    -------
    joined : DataFrame